Repository: gvkunchev/web_cv
Catalog: cv/locale/*/LC_MESSAGES/django.po
Languages: bg

source: CV Georgi Kunchev
bg: CV Георги Кунчев

source: Georgi Viktorov Kunchev
bg: Георги Викторов Кунчев

source: Python Developer with almost 15 years of professional experience.
bg: Python Developer с почти 15 години професионален опит.

source: <li>Several personally developed Django projects, the biggest one of which is <a class="text-dark" href="https://github.com/gvkunchev/shrubbery" target="_blank">the website for the Python course at FMI.</a></li> <li>Several personally developed, small Flask projects.</li> <li>Experience with Django REST in the context of basic application.</li> <li>Basic skills in configuring Apache, Nginx, Gunicorn and their communication with Django through WSGI.</li> <li>Variety of desktop applications using TKinter and a couple using PySide.</li> <li>Asynchronous tasks using Celery.</li> <li>Experience with PostgreSQL and SQLite.</li> <li>A lot of JavaScript (vanilla and jQuery) without claiming it is idiomatic. Ajax.</li> <li>Linux shell scripting. PowerShell with some help from Google.</li> <li>Comfortable in both Linux and Windows.</li> <li>Object oriented programming, but not at any cost. Every paradigm should know its place!</li> <li>Time complexity monitoring and algorithm optimization.</li> <li>Git and very little experience with SVN and ClearCase.</li> <li>PEP8, Pylint, Flake8, UnitTest, Coverage, Pyreverse, Swagger, UML are important and must be used.</li> <li>CI/CD using BitBucket + Jenkins, as well as GitHub + GitHub Actions. Docker and a little Kubernetes.</li> <li>Wheel, PyPi, Artifactory, RPM and other package distribution methods.</li> <li>Conducting internal trainings and technical interviews with new employees.</li> <li>IoT, robotics and microcontrollers as a hobby.</li> <li>Monty Python fan.</li> <li>1700 ELO in blitz and ~20 varieties of the Rubik's cube.</li>
bg: <li>Няколко самостоятелни Django проекта, най-големият от които е <a class="text-dark" href="https://github.com/gvkunchev/shrubbery" target="_blank">сайтът за курс по Python във ФМИ</a></li> <li>Няколко самостоятелни малки Flask проекта.</li> <li>Опит с Django REST в контекста на семпло приложение.</li> <li>Основни умения за конфигурация на Apache, Nginx, Gunicorn и комуникацията им с Django през WSGI.</li> <li>Множество десктоп приложения с TKinter и няколко с PySide.</li> <li>Асинхронни задачи със Celery.</li> <li>Опит с PostgreSQL и SQLite.</li> <li>Доста JavaScript (vanilla и jQuery) без претенции, че е идиоматичен. Ajax.</li> <li>Linux shell scripting. PowerShell с помощ от Google.</li> <li>Комфортна работа както в Linux, така и в Windows.</li> <li>Обектно ориентирано програмиране, но не на всяка цена. Всяка парадигма да си знае гьола!</li> <li>Time complexity мониторинг и оптимизация на алгоритми.</li> <li>Git и бегъл опит със SVN и ClearCase.</li> <li>PEP8, Pylint, Flake8, UnitTest, Coverage, Pyreverse, Swagger, UML са важни и трябва да се използват.</li> <li>CI/CD чрез BitBucket + Jenkins, както и GitHub + GitHub Actions. Docker и малко Kubernetes.</li> <li>Wheel, PyPi, Artifactory, RPM и други методи за дистрибуция на пакети.</li> <li>Провеждане на вътрешнофирмени обучения и технически интервюта на нови кандидати.</li> <li>IoT, роботика и микроконтролери като хоби.</li> <li>Monty Python фен.</li> <li>1700 ЕЛО на блиц и ~20 разновидности на кубчето на Рубик.</li>

source: All categories
bg: Всички категории

source: Personal
bg: Лични

source: Professional
bg: Професионални

source: Education
bg: Образование

source: Born
bg: Роден

source: 30 March 1990
bg: 30 Март 1990

source: Oriahovo
bg: Оряхово

source: Primary Education
bg: Основно образование

source: OU "N. Y. Vaptsarov"<br/>Selanovtsi
bg: ОУ "Н. Й. Вапцаров"<br/>с. Селановци

source: The only one with 6.00 at the high school candidate exam in Mathematics for the administrative area
bg: Единственият с резултат 6.00 на кандидат-гимназисткия изпит по математика за областта

source: Third place at a national mathematics competition
bg: Трето място на национално състезание по математика

source: Natural Science and Mathematical School "Akademik Ivan Tsenov"<br/>Vratza
bg: ПМГ "Академик Иван Ценов"<br/>гр. Враца

source: Secondary education
bg: Средно образование

source: Tertiary education<br/> (dropped)<br/>/Software engineering/
bg: Висше образование<br/>(прекъснал)<br/>/Софтуерно инженерство/

source: Faculty of mathematics and Informatics, Sofia University "St. Kliment Ohridski"
bg: ФМИ към СУ "Св. Климент Охридски"<br/>гр. София

source: Developer of marketing research surveys<br/><i class='small'>(Python, HTML, CSS, JavaScript, Flash)</i>
bg: Програмист маркетингови проучвания<br/><i class='small'>(Python, HTML, CSS, JavaScript, Flash)</i>

source: "Bright Marketing Research"<br/>Sofia
bg: "Брайт Маркетинг Рисърч"<br/>гр. София

source: Awarded with an MVP prize by the company
bg: Получава приз MVP на фирмата

source: Becomes a proud father of Victoria
bg: Става горд баща на Виктория

source: "Mother's Home" Hospital<br/>Sofia
bg: Болница "Майчин дом"<br/>гр. София

source: Senior Python Developer<br/>&<br/>Tech Lead<br/><i class='small'>(Python, Django, CI/CD with Jenkins and GitHub Actions)</i>
bg: Senior Python Developer<br/>&<br/>Tech Lead<br/><i class='small'>(Python, Django, CI/CD с Jenkins и GitHub Actions)</i>

source: "Strypes"<br/>Sofia
bg: "Страйпс"<br/>гр. София

source: Lecture for dev.bg
bg: Лекция за dev.bg

source: Python Lecturer
bg: Лектор по Python

source: Python course at FMI
bg: Курс по Python във ФМИ

source: Creates the website for the Python course at FMI<br/><i class='small'>(Python, Django, jQuery, Bootstrap, PostgreSQL, Celery, Docker)</i>
bg: Създава сайт за курса по Python във ФМИ<br/><i class='small'>(Python, Django, jQuery, Bootstrap, PostgreSQL, Celery, Docker)</i>

source: The project at GitHub
bg: Проектът в GitHub

source: Creates the current CV
bg: Създава текущото CV
